---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintSagittaLength
source: html/8d4fd69c-1f2f-6c06-e25d-cb3ad49a2307.htm
---
# RebarShapeConstraintSagittaLength Members

Create a constraint to drive sagitta length.